/* 算法思想:
假设序列A的中位数为a,序列B的中位数为b
1、若a == b，中位数为a，算法结束
2、若a < b, 舍去A中前一半数据和B中后一半数据
3、若a > b, 舍去A中后一半数据和B中前一半数据
重复1，2，3步骤，直到两个序列均只含有一个元素，取较小者即为所求中位数
*/

int M_search(int A[], int B[], int n)
{
	int s1 = 0, d1 = n - 1, m1, s2 = 0, d2 = n - 1;
	// 分别为A和B的首位、末位、中位数
	while (s1 != d1 || s2 != d2)
	{
		m1 = (s1 + d1) / 2;
		m2 = (s2 + d2) / 2;
		if (A[m1] == B[m2])
			return A[m1];
		if (A[m1] < B[m2])
		{
			if ((s1 + d1) % 2 == 0) // 剩余序列元素为奇数
			{
				s1 = m1;
				d2 = m2;
			}
			else
			{
				s1 = m1 + 1;
				d2 = m2;
			}
		}
		else
		{
			if ((s1 + d1) % 2 == 0) // 剩余序列元素为奇数
			{
				d1 = m1;
				s2 = m2;
			}
			else
			{
				d1 = m1;
				s2 = m2 + 1;
			}
		}
	}//while
	return A[m1] < B[m2] ? A[m1] : B[m2];
}